INSERT INTO singers (name)
values
('Алиса'),
('Король и Шут'),
('Бьянка'),
('Дима Билан'),
('Баста'),
('Тимати'),
('Полина Гагарина'),
('МакSим');

INSERT INTO musical_genre (name)
values
('Rock'),
('RnB'),
('Pop'),
('Punk'),
('Rap');

INSERT INTO albums (name, year)
values
('Трудный возраст', 2006),
('Русский народный RnB', 2018),
('Олимп', 2010),
('Попроси у облаков', 2007),
('Время река', 2018),
('Мои мечты', 2009),
('Твердый знак', 2009),
('Тень клоуна', 2008);

INSERT INTO tracks (name, duration, album_id)   --- Максим
VALUES
('Нежность', 196, 1),
('Сантиметры дыханья (remix)', 189, 1),
('Отпускаю (artefact mix)', 229, 1),
('Трудный возраст', 222, 1),
('Нежность (rnb remix)', 208, 1),
('Сантиметры дыханья', 207, 1),
('Трудный возраст (slow version)', 180, 1),
('Лолита', 248, 1),
('Сон', 201, 1),
('Отпускаю', 259, 1),
('Знаешь Ли Ты', 241, 1),
('Небо цвета молока', 93, 1),
('Ветром стать', 190, 1),
('Нежность (remix acid-jazz)', 273, 1);

INSERT INTO tracks (name, duration, album_id)   --- Бьянка
VALUES
('Бьянка-Музыка', 226, 2),
('Ау', 179, 2),
('Рага', 180, 2),
('Кеды', 177, 2),
('Frau', 155, 2),
('Taxi', 223, 2),
('П.А.', 220, 2),
('Леха', 188, 2),
('Таня', 170, 2),
('Крыша', 235, 2),
('Обида', 168, 2),
('Яички', 202, 2),
('Шайзе', 147, 2),
('Люблю', 201, 2),
('Сосны', 187, 2),
('Интро', 42, 2),
('Спаси', 231, 2),
('Матня', 103, 2),
('Эминем', 236, 2);

INSERT INTO tracks (name, duration, album_id)   --- Тиматим "Олимп"
VALUES
('Дай Мне Уйти', 246, 3),
('Где Ты, Где Я', 282, 3),
('Новая Русская Мечта', 231, 3),
('Домой', 185, 3),
('О Последней Любви На Земле', 252, 3),
('Олимп', 220, 3),
('Баклажан', 186, 3),
('Домофон', 220, 3),
('Давай', 211, 3),
('Девочка-Конфета', 177, 3),
('Ключи От Рая', 198, 3),
('Конская Сила', 222, 3),
('Мага', 229, 3),
('Финал', 289, 3),
('Маленький Принц', 262, 3);

INSERT INTO tracks (name, duration, album_id)   --- Полина Гагарина
VALUES
('Прикосновенья', 205, 4),
('Помню', 200, 4),
('Ты мой', 202, 4),
('Я твоя', 197, 4),
('Time Stop', 248, 4),
('Ветер', 222, 4),
('Колыбельная', 211, 4),
('Give Up', 174, 4),
('Я тебя не прощу никогда', 255, 4),
('Dont Waste Your Time', 189, 4),
('Morning', 223, 4);

INSERT INTO tracks (name, duration, album_id) --- Дима Билан
VALUES
('Мир', 207, 5),
('SMS', 200, 5),
('Бум', 235, 5),
('Рай', 224, 5),
('Lady', 222, 5),
('Часы', 182, 5),
('Пока', 194, 5),
('Жуть', 193, 5),
('Дыши', 230, 5),
('Атом', 190, 5),
('Honey', 199, 5),
('Малыш', 212, 5),
('Осень', 241, 5),
('Держи', 220, 5),
('Океан', 274, 5),
('Химия', 197, 5),
('Милая', 250, 5),
('Тоска', 225, 5);

INSERT INTO tracks (name, duration, album_id) --- Баста
VALUES
('Поэт', 246, 6),
('Кто, Если Не Я', 333, 6),
('О, Фомин, Play For Me!', 305, 6),
('Скажи Мне Все Как Есть', 222, 6),
('Кинуть Лоха', 339, 6),
('Саперная', 438, 6),
('Нет такой, как ты', 276, 6),
('Одно Дело', 275, 6),
('Россия', 246, 6),
('Всем Кто Нас Слушает', 529, 6),
('Жизнь-кастинг', 262, 6),
('Музыка Моего Гетто', 307, 6),
('Настенька', 225, 6),
('Шутники', 208, 6),
('Танцпол', 322, 6),
('Мои Мечты', 288, 6),
('Чудо Чай', 205, 6),
('Цска Чемпион', 94, 6);

INSERT INTO tracks (name, duration, album_id) --- Алиса
VALUES
('Путь', 382, 7),
('Главное', 205, 7),
('Дождь и Я', 250, 7),
('Звезда', 281, 7),
('Кода', 247, 7),
('Крен', 272, 7),
('Работа', 218, 7),
('Страх', 363, 7),
('Твердый знак', 231, 7),
('Фавор', 326, 7);

INSERT INTO tracks (name, duration, album_id) --- Король и Шут
VALUES
('Клейменный огнем', 275, 8),
('Кода', 233, 8),
('Суфлер', 250, 8),
('Тень клоуна', 137, 8),
('Полутень клоуна', 33, 8),
('Смешной пистолетик', 146, 8),
('Вестник', 219, 8),
('Двое против всех', 232, 8),
('Невидимка', 233, 8),
('Тринадцатая рана', 161, 8),
('Дагон', 302, 8),
('Полутень Заговор в суде', 38, 8),
('Полутень зомби', 25, 8),
('Санта Клаус', 194, 8),
('В Париж домой', 295, 8),
('Фред', 200, 8),
('Ричард Гордон', 213, 8),
('Ходит зомби', 116, 8),
('A.M.T.V.', 234, 8);

INSERT INTO singers_musical_genre  (musical_genre_id, singers_id)
VALUES
(1, 1),
(1, 2),
(2, 3),
(3, 4),
(3, 5),
(3, 7),
(3, 8),
(4, 2),
(5, 5),
(5, 6);

INSERT INTO singers_albums (singers_id, albums_id)
VALUES
(1, 7),
(2, 8),
(3, 2),
(4, 5),
(5, 6),
(6, 3),
(7, 4),
(8, 1);

INSERT INTO compilation  (name, year)
values
('Хиты всех времен', 2018),
('Топ 100 лучших русских песен', 2020),
('Легенды русского рока', 2016),
('Красивая музыка для души', 2017),
('Песни про любовь', 2021),
('Лирические песни', 2019),
('Классика хип хопа',2018),
('Красивый рэп про любовь',2020);

INSERT INTO compilation_tracks (tracks_id, compilation_id)
values(unnest(array[96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124]), 3);

INSERT INTO compilation_tracks (tracks_id, compilation_id)
values(unnest(array[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77]), 1);

INSERT INTO compilation_tracks (tracks_id, compilation_id)
values(unnest(array[60, 61, 62, 63, 64, 1, 2, 3, 4, 5, 78, 79, 80, 81, 82]), 2);

INSERT INTO compilation_tracks (tracks_id, compilation_id)
values(unnest(array[6, 7, 8, 9, 10, 49, 50, 51, 52, 53]), 4);

INSERT INTO compilation_tracks (tracks_id, compilation_id)
values(unnest(array[15, 16, 17, 18, 19, 34, 35, 36, 37, 38, 78, 79, 80, 81, 82]), 5);

INSERT INTO compilation_tracks (tracks_id, compilation_id)
values(unnest(array[16, 19, 21, 35, 39, 40, 83, 84, 85]), 6);

INSERT INTO compilation_tracks (tracks_id, compilation_id)
values(unnest(array[7, 8, 9, 10, 54, 55, 56, 57]), 7);

INSERT INTO compilation_tracks (tracks_id, compilation_id)
values(unnest(array[20, 21, 22, 23, 39, 40, 41, 42, 43]), 8);












